
&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	ВыполнитьЗапросНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗапросНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВходящийЗапрос.ВерсияДанных,
		|	ВходящийЗапрос.Дата,
		|	ВходящийЗапрос.МоментВремени,
		|	ВходящийЗапрос.Номер,
		|	ВходящийЗапрос.ПометкаУдаления,
		|	ВходящийЗапрос.Представление,
		|	ВходящийЗапрос.Проведен,
		|	ВходящийЗапрос.Ссылка,
		|	ВходящийЗапрос.ДатаЗапроса,
		|	ВходящийЗапрос.ТелоЗапроса
		|ИЗ
		|	Документ.ВходящийЗапрос КАК ВходящийЗапрос";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СообщениеПользователю = Новый СообщениеПользователю();
		СообщениеПользователю.Текст = "Обход Выборки";
		СообщениеПользователю.Сообщить();
	КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
